<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">
<html>
    <head>
        <title></title>
        <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
        <meta content="MSHTML 6.00.2900.3354" name="GENERATOR">
    </head>
    
    <body leftmargin="15" style="background-image: url(images/background.jpg);">
        <p align="right"><img alt="" src="images/deegree_logo.jpg" border="0" height="71" width="300"></p>
        <table background="" border="0" cellpadding="4" cellspacing="4" width="100%">
            <tbody>
                <tr>
                    <td></td>
                </tr>
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left">
                        <h2>Eine neue Kartenebene auf Rasterdatenbasis anlegen</h2>
                    </td>
                </tr>
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left"><p>Rasterdaten k&ouml;nnen in Form von georeferenzierten Bilddateien (mit WorldFile), einen wms (Web Map Service) oder 
                                wcs (Web Coverage Service) in ein Projekt geladen werden.<br><br>
                                <strong>Bilddateien</strong> (*.gif, *.tif, *.png, *.jpg, *.bmp) k&ouml;nnen 
                                folgenderma&szlig;en geladen werden:<br>
                                Entweder &uuml;ber die Men&uuml;leiste zu 
                            <font face="Courier New"><i>Projekt &gt; <img src="images/s_openFile.png"> Ebene aus Datei hinzuf&uuml;gen
                            </i></font>
                            <font face="Arial"> navigieren (bzw. die Tastenkombination </font> 
                            <font face="Courier New"><i>Alt+F </i></font> 
                            <font face="Arial">
                                verwenden). Aus der angebotenen Liste die entsprechende Datei ausw&auml;hlen, und durch 
                                Bet&auml;tigen des 
                            </font>
                            <font face="Courier New"><i> &ouml;ffnen</i></font>
                            <font face="Arial">
                                -Buttons &uuml;bernehmen. Die Datei wird, ohne dass weitere Einstellungen vorgenommen 
                                werden k&ouml;nnen, dem aktuellen Projekt an der untersten Position in der Ebenenansicht 
                                zugef&uuml;gt.<br><br>
                                Oder &uuml;ber den Startdialog <img src="images/addLayer.png">
                            </font>
                            <font face="Courier New"><i> Ebene hinzuf&uuml;gen </i></font> 
                            <font face="Arial"> zu </font>
                            <font face="Courier New"><i>
                                Rasterdaten &gt; <img src="images/raster_filelayer_icon.png"> Datei 
                            </i></font> 
                            <font face="Arial">
                                navigieren, diesen Eintrag markieren auf <img src="images/next.png"> und 
                                anschlie&szlig;end auf <img src="images/select_file.png"> klicken. 
                                Aus der angebotenen Liste die entsprechende Datei ausw&auml;hlen, und durch 
                                Bet&auml;tigen des 
                            </font>
                            <font face="Courier New"><i>&ouml;ffnen</i></font>
                            <font face="Arial">
                                -Buttons &uuml;bernehmen. Im Anschluss daran k&ouml;nnen Angaben zu Name, Titel, 
                                Kurzbeschreibung und Koordinatensystem gemacht werden. Nachdem auf 
                                <img src="images/finish.png"> geklickt wurde, wird die ausgew&auml;hlte Ebene an der 
                                untersten Position in der Ebenenansicht hinzugef&uuml;gt.<br><br>
                                Auf den <strong>wms</strong>  kann wie folgt zugegriffen werden:<br>
                                Innerhalb des Dialogfensters </font> 
                            <font face="Courier New"><i> Ebene hinzuf&uuml;gen </i></font> 
                            <font face="Arial"> &uuml;ber </font>
                            <font face="Courier New"><i> Rasterdaten </i></font> 
                            <font face="Arial">zu </font>  
                            <font face="Courier New"><i> <img src="images/wmslayer_icon.png">  WMS </i></font> 
                            <font face="Arial">
                                navigieren, diesen Eintrag markieren und auf <img src="images/next.png"> klicken.    
                                Innerhalb des n&auml;chsten Dialoges entweder aus den vorkonfigurierten Services den 
                                gew&uuml;nschten Service ausw&auml;hlen, oder selbigen als URL manuell eingeben und auf 
                                <img src="images/next.png"> klicken. 
                                Die nun zur Verf&uuml;gung stehenden Ebenen unterscheiden sich hinsichtlich ihrer 
                                Anfragem&ouml;glichkeiten wie folgt:<br><br> 
                                &bull; &nbsp;<img src="images/green.png">= GetMap und GetFeatureInfo Anfrage 
                                m&ouml;glich<br> 
                                &bull; &nbsp;<img src="images/yellow.png">= GetMap m&ouml;glich aber kein GetFeatureInfo
                                <br>
                                &bull; &nbsp;<img src="images/red.png">= GetMap und GetFeatureInfo Anfrage nicht 
                                m&ouml;glich (WMS kann nicht geladen werden)<br><br>
                                Im Anschluss daran k&ouml;nnen die gew&uuml;nschten Ebenen einzeln oder als thematische 
                                Gruppe, durch Klicken auf <img src="images/for.png"> ausgew&auml;hlt und der 
                                Ebenenauswahl hinzugef&uuml;gt bzw. durch <img src="images/back.png"> wieder aus der 
                                Ebenenauswahl entfernt werden. 
                                Durch das Klicken auf <img src="images/forward.png"> werden alle verf&uuml;gbaren Ebenen 
                                in die Auswahl &uuml;bernommen, bzw. durch <img src="images/backward.png"> 
                                entfernt. Werden mehrere Ebenen in die Ebenenauswahl &uuml;bernommen, kann ihre 
                                Reihenfolge &uuml;ber die entsprechenden Pfeilbuttons <img src="images/up.png"> 
                                <img src="images/down.png"> angepasst werden. 
                                Um eine Ebene in die Auswahl &uuml;bernehmen oder verschieben zu k&ouml;nnen, muss diese 
                                zuvor selektiert werden. Ist die Auswahl und Reihenfolge festgelegt, k&ouml;nnen die 
                                gew&uuml;nschten Ebenen ohne weitere Einstellungen vorzunehmen in das aktuelle Projekt 
                                geladen werden indem auf <img src="images/finish.png"> geklickt wird. 
                                In diesem Fall, wird der Kartenhintergrund nicht transparent dargestellt und alle 
                                ausgew&auml;hlten Ebenen werden in der angegebenen Reihenfolge zu einer Ebene 
                                zusammengefasst, welche im .gif-Format geladen wird.<br>
                                Es k&ouml;nnen allerdings auch weitere Einstellungen vorgenommen werden, bevor die 
                                Ebene(n) final geladen werden, hierzu auf <img src="images/next.png"> klicken:<br><br>
                                &bull; Vorschau der Ebenendarstellung anzeigen:  
                                H&auml;kchen im betreffenden Feld setzen und auf die gew&uuml;nschte Ebene klicken<br>
                                &bull; Auswahl des Bild-Formates:  *.gif, *.png, *.jpg, *.tif, *.bmp<br>
                                &bull; Transparente Darstellung des Hintergrundes: immer dann empfehlenswert, wenn die 
                                Ebene nicht als unterste Ebene angezeigt werden soll.<br>
                                &bull; Einzelnes Laden der ausgew&auml;hlten Ebenen: in diesem Fall k&ouml;nnen Namen, 
                                Titel und Kurzbeschreibung f&uuml;r die einzelnen Ebenen vergeben werden.<br>
                                &bull; Bearbeitung der Ebeneninformationen: Name, Titel, Kurzbeschreibung, Eingrenzung 
                                des Ma&szlig;stabsbereiches <br><br>
                                Auf den <strong>wcs</strong> kann wie folgt zugegriffen werden:<br>
                                Innerhalb des Dialogfensters <font face="Courier New"><i> Ebenen hinzufügen </i></font> über <font face="Courier New"><i> Rasterdaten </i></font> zu <font face="Courier New"><i> <img src="images/wcslayer_icon.png"> WCS </i></font> navigieren, diesen Eintrag markieren und auf <img src="images/next.png"> klicken. 
                                Innerhalb des nächsten Dialoges entweder aus den vorkonfigurierten Services den gewünschten Service auswählen, oder selbigen als URL manuell eingeben und auf <img src="images/next.png"> klicken.  
                                Innerhalb des nächsten Dialoges aus den verfügbaren Coverages das/die gewünschten auswählen (selektieren) und mittels des  <img src="images/for.png"> Buttons in die Auswahl übernehmen und auf <img src="images/finish.png"> klicken. In diesem Fall wir das gewünschte Coverage als *.jpeg geladen.<br>
								Es besteht außerdem die Möglichkeit, innerhalb der nächsten zwei Dialogfenster das gewünschte Bildformat zu modifizieren (*.jpeg, *.GeoTIFF, *.png) und weiterführende Angaben zur neue Ebene vorzunehmen (Name, Titel, Kurzbeschreibung, Eingrenzung des Ma&szlig;stabsbereiches). 
								Hierfür jeweils auf <img src="images/next.png"> klicken. 
                           
                        </p> 
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
