<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">
<html>
    <head>
        <title></title>
        <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
        <meta content="MSHTML 6.00.2900.3354" name="GENERATOR">
    </head>
    <body leftmargin="15" style="background-image: url(images/background.jpg);">
        <p align="right"><img alt="" src="images/deegree_logo.jpg" border="0" height="71" width="300"></p>
        <table background="" border="0" cellpadding="4" cellspacing="4" width="100%">
            <tbody>
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left">
                        <h1>Klassifikation</h1>
                    </td>
                </tr>
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left">
                        <p>Polygone, Linien und Punktobjekte k&ouml;nnen Klassifiziert werden. 
                                Die <strong>Klassifikation</strong> dient als Hilfsmittel zur Strukturierung und 
                                Verdichtung von Informationen. Bei der Festlegung der Klassenanzahl, sollte folgende 
                                grobe Richtlinie ber&uuml;cksichtigt werden:  <br><br>
                                <img src="images/classes_formula.png"><br><br>
                                Wird eine Schwarz-Wei&szlig; Darstellung gew&auml;hlt, bzw. eine Helligkeitsabstufung 
                                einer Farbe, k&ouml;nnen vom menschlichen Auge nur bis zu 7 Klassen auch sicher 
                                unterschieden werden. Bei Farbverl&auml;ufen mit zwei Farben sind es noch bis zu 14 
                                Klassen. Dies sollte bei einer Klassifikation ebenso beachtet werden, wie die Tatsache, 
                                dass gebildete Gruppen nicht weniger als zwei Elemente enthalten sollten. Eine Klasse 
                                mit nur einem Element widerspricht dem Grundsatz, dass Elemente einer Klasse 
                                untereinander &auml;hnlicher sind als die in unterschiedlichen Klassen. Ausnahmen bilden 
                                Extremwerte oder sachlogische Werte (Indexzahlen, Nullwerte, gesetzlich festgelegte 
                                oder physikalische Grenzwerte), die je nach Kontext hervorgehoben werden sollten.
                                <br><br>
                                Das Hauptziel einer Klassifizierung ist die Veranschaulichung von r&auml;umlichen 
                                Mustern und Strukturen, nicht die Darstellung von statistischen Einzelwerten an sich. 
                                Ein Grundprinzip der thematischen Kartographie liegt im weniger ist mehr: erst durch die 
                                Reduktion der Detailinformationen von Objekten auf die Auspr&auml;gungen weniger 
                                Klassen, werden die wesentlichen Grundz&uuml;ge r&auml;umlicher Muster klar ersichtlich.
                                <br><br>
                                Derzeit stehen folgende Klassifikationen zur Verf&uuml;gung:</p>
                        <table style="font-family:Arial,sans-serif; align:left">
                            <tr>
                                <td width="150px"><strong>Qualitativ</strong> (unique value)
                                </td>
                                <td width="800px">Diese Art der Klassifikation wird f&uuml;r qualitative, nominale Attribute 
                                        verwendet und erfolgt in der Regel nicht nach absoluten Regeln, sondern 
                                        begrifflichen Definitionen oder Ordnungsschemata. Die Klassenzahl wird somit 
                                        durch den Grad der Aggregation der Information bestimmt.
                                </td>
                            </tr>
                            <tr>
                                <td><strong>gleiche Intervalle</strong> (equal interval)
                                </td>
                                <td>Die einfachste Methode der Klassifikation wird f&uuml;r qualitative Daten 
                                        verwendet und weist allen Klassen den gleichen Abstand zwischen 
                                        Klassenobergrenze und Klassenuntergrenze zu. Diese Klassifikation eignet sich 
                                        f&uuml;r gleichm&auml;&szlig;ig verteilte Datenmengen und f&uuml;r den Vergleich 
                                        verschiedener Karten &uuml;ber Zeit und Raum hinweg. 
                                        Nachteilig ist, dass sich leere Klassen oft nicht vermeiden lassen, vor allem 
                                        bei sehr ungleichm&auml;&szlig;iger Datenverteilung.
                                </td>
                            </tr>
                            <tr>
                                <td><strong>Quantile</strong> (quantil)
                                </td>
                                <td>Ist eine relativ einfache Methode zur Klassifikation qualitativer Daten, bei der 
                                        alle Klassen gew&ouml;hnlich mit der gleichen Anzahl von Werten besetzt sind. 
                                        Diese Klassifikation eignet sich nur f&uuml;r linear verteilte Daten, da 
                                        L&uuml;cken in der Verteilung der Daten nicht ber&uuml;cksichtigt werden und die 
                                        Klassenbreiten stark variieren k&ouml;nnen.
                                        </td>
                            </tr>
                        </table>
                        <p>Handelt es sich um einen unbekannten Datensatz, ist es von Vorteil sich vor der 
                                Klassifikation die Verteilung der Daten anzusehen, um die geeignete 
                                Klassifizierungsmethode ausw&auml;hlen zu k&ouml;nnen. Hierf&uuml;r steht nach der 
                                Auswahl des entsprechenden Attributes die Option <img src="images/show_histogram.png"> 
                                zur Verf&uuml;gung.<br><br>
                                <img src="images/histogramdialog.png"> <br><br>
                                Jede automatisch erstellte Klassifikation, kann manuell hinsichtlich ihrer 
                                Klassenobergrenze angepasst werden. Nach der Korrektur des Wertes und dem Bet&auml;tigen 
                                der 
                            <font face="Courier New"> [Enter] </font> 
                           Taste, wird die Abfolge der Klassen neu sortiert, die anderen Klassenbreiten werden 
                                dabei nicht ver&auml;ndert. Bereits angewendete Farbschemata oder Muster k&ouml;nnen 
                                erneut angewendet werden (Rechtsklick auf den entsprechenden Eintrag &gt; aus dem 
                                Kontextmen&uuml; die gew&uuml;nschte Aktion ausw&auml;hlen).<br><br>
                                Unabh&auml;ngig von der Verwendung eines vordefinierten Farbschemas, kann jede Farbe 
                                auch manuell angepasst und/oder mit einem Muster versehen werden (Doppelklick auf die 
                                entsprechende Farbe &gt; aus dem sich &ouml;ffnenden Dialogfenster die gew&uuml;nschte 
                                Aktion ausw&auml;hlen). Dasselbe gilt f&uuml;r alle anderen aufgef&uuml;hrten 
                                Darstellungskriterien wie Linienart, Linienfarbe, usw.<br><br>
                        </p>
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
