<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">
<html>
    <head>
        <title></title>
        <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
        <meta content="MSHTML 6.00.2900.3354" name="GENERATOR">
    </head>
    
    <body leftmargin="15" style="background-image: url(images/background.jpg);">
        <p align="right">
            <img alt="" src="images/deegree_logo.jpg" border="0" height="71" width="300">
        </p>
        <table background="" border="0" cellpadding="4" cellspacing="4" width="100%">
            <tbody align="left">
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left">
                        <h1>Darstellung bearbeiten</h1>
                    </td>
                </tr>
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left">
                    <p>Mit Hilfe der Funktion:<font face="Courier New"><i> Objekt Darstellung bearbeiten </i></font> 
                           k&ouml;nnen sowohl Raster-, als auch Vektordaten hinsichtlich ihres Erscheinungsbildes 
                                ver&auml;ndert werden. Nachdem die entsprechende Ebene in der Ebenenansicht sichtbar 
                                geschaltet und selektiert wurde (gelb hinterlegt), kann diese Funktion entweder 
                                &uuml;ber die Men&uuml;-Leiste 
                            <font face="Courier New"><i> &gt; Objekt-Darstellung bearbeiten </i></font> 
                            oder &uuml;ber den <img src="images/palette.png"> Button in der Werkzeug-Leiste 
                                aufgerufen werden. 
                                Der Startdialog zeigt den Objekt-Typ, die Geometrie-Eigenschaften, die Geometrie-Art und 
                                den Ma&szlig;stabsbereich an.<br><br>
                                In der Regel m&uuml;ssen hier keine Einstellungen ver&auml;ndert werden, sodass mit 
                                Hilfe des <img src="images/edit_style.png"> Buttons die eigentliche Anwendung aufgerufen 
                                werden kann.<br> 
                                Innerhalb des sich im Anschluss &ouml;ffnenden Dialogfensters, ist das Register mit der 
                                entsprechenden Geometrie durch ein farblich hervorgehobenes Symbol 
                                <img src="images/flag_green.png"> gekennzeichnet.
                                Innerhalb dieses Registers kann nun die Darstellung bearbeitet werden. Vektordaten 
                                einschlie&szlig;lich ihrer Beschriftungs-Optionen k&ouml;nnen, je nachdem welchen 
                                Geometrie-Typ sie repr&auml;sentieren, hinsichtlich folgender Parameter ver&auml;ndert 
                                werden:<br><br>
                                <img src="images/style_parameter.png"><br><br>
                                Das Farbschema kann jeweils &uuml;ber den <img src="images/color_scheme.png"> Button als 
                                separater Dialog aufgerufen werden. 
                                Innerhalb dieses Dialoges ist es m&ouml;glich, aus vordefinierten Musterfarben, HSB und 
                                RGB Farbr&auml;umen, sowie &uuml;ber die Funktion 
                            <font face="Courier New"><i> Grab from Screen </i></font> 
                           die gew&uuml;nschten Farben zu w&auml;hlen. Durch das Best&auml;tigen mit
                            <font face="Courier New"><i> OK </i></font> 
                            werden die &Auml;nderungen &uuml;bernommen und angezeigt.<br><br>
                                Innerhalb des Reiters
                            <font face="Courier New"><i> Symbole, </i></font>
                           k&ouml;nnen der Liste Symbol ausw&auml;hlen neue Symbole im *.jpg, *.tiff, *.png, 
                                *.bmp und *.gif Format hinzugef&uuml;gt werden. Nachdem die entsprechende Datei 
                                ausgew&auml;hlt und ge&ouml;ffnet wurde, kann der Name des Symbols eingetragen und 
                                gespeichert werden. Analog dazu k&ouml;nnen innerhalb des Reiters
                            <font face="Courier New"><i> Polygone </i></font> 
                           der Fl&auml;chenmusterliste neue Muster hinzugef&uuml;gt werden.<br><br>
                                <img src="images/style_symbols.png"></p>
                    </td>
                </tr>
                <tr>
                    <td style="font-family:Arial,sans-serif; align:left"><p>F&uuml;r <strong>Rasterdaten</strong> ist bisher lediglich die Ver&auml;nderung der Helligkeit und der 
                                Transparenz, &uuml;ber die entsprechenden Dialoge vorgesehen</p>
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
