<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">
<html>
	<head>
	  <title></title>
	  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
	  <meta content="MSHTML 6.00.2900.3354" name="GENERATOR">
	</head>

	<body leftmargin="15" style="background-image: url(images/background.jpg);">
	<p align="right"><img alt="" src="images/deegree_logo.jpg" border="0" height="71" width="300"></p>
		<table border="0" cellpadding="4" cellspacing="4" width="100%">
			<tbody style="font-family:Arial,sans-serif; align:left"> 
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
						<h2>Neue Objekte erstellen</h2>
						<p>
                        
						  Mit Hilfe der Funktionen innerhalb dieses Reiters, k&ouml;nnen manuell neue Objekte im Vektorformat erstellt werden.  
						  Basisdatentypen sind Punkt, Linie und Fl&auml;che. Jedes neu erstellte Objekt wird von einer Liste geordneter x,y-Koordinaten, sowie entsprechenden Attributen repr&auml;sentiert. 
						  Bevor ein neues Objekt gezeichnet werden kann, muﬂ der entsprechende Ziel-Ebene in der Ebenenansicht selektiert (klick mit der LM-Taste) und editierbar (klick mit der RM-Taste und aus dem Kontextmen&uuml; 'editierbar' ausw&auml;hlen) geschaltet werden. <br><br>
						 <img src="images/create_dialog.png">
                        
						</p>
					</td>
				</tr>
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					  <br></br>
					  <h3>Polygone neu erstellen</h3>
						<p>Ein Polygon stellt eine Fl&auml;che dar, welche von einer geschlossenen Linie umgrenzt wird. 
						  Polygone k&ouml;nnen nur in einem Ebene gezeichnet werden, welcher die entsprechende Geometrie unterst&uuml;tzt bzw. enth&auml;lt. 
						  Um folgende Polygontypen zeichnen zu k&ouml;nnen, muﬂ vor dem Zeichnen der entsprechende Button aktiviert werden (klick LM-Taste):</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/shape_square_create.gif"> <strong>&nbsp; Rechteck</strong>: 
					Der Akteur bewegt den Mauszeiger zu der Stelle in der Kartenansicht, an welcher er das Rechteck zeichnen will. 
					Der Zeichenvorgang beginnt, sobald die LM-Taste gedr&uuml;ckt wird und endet sobald diese wieder losgelassen wird. 
					Sobald die LM-Taste gedr&uuml;ckt wird erscheint ein neues Fenster, welches die Eigenschaften des neuen Objektes angezeigt und die 
					M&ouml;glichkeit zur Speicherung bzw. Verwerfung des neuen Objektes bietet.</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/rect_create_by_size.gif"> <strong>&nbsp; Rechteck mit definierter Kantenl&auml;nge</strong>: 
					Nach dem Aktivieren der Funktion (Klick auf Button) wird der Mittelpunkt des zu zeichnenden Rechtecks durch Klicken mit der linken Maustaste in die Karte festgelegt.
					Im sich anschlieﬂend &ouml;ffnenden Dialogfenster, k&ouml;nnen die Kantenl&auml;ngen in Karteneinheiten angegeben werden.</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/circle_create.gif"> <strong>&nbsp;Kreis</strong>: 
					 Der Akteur bewegt den Mauszeiger zu der Stelle in der Kartenansicht, an welcher sich der Mittelpunkt des Kreises befinden soll. 
					 Der Zeichenvorgang beginnt, sobald die LM-Taste gedr&uuml;ckt wird und endet sobald diese wieder losgelassen wird. 
					 Sobald die LM-Taste gedr&uuml;ckt wird erscheint ein neues Fenster, welches die Eigenschaften des neuen Objektes angezeigt und die M&ouml;glichkeit zur 
					 Speicherung bzw. Verwerfung des neuen Objektes bietet.</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/ellipse_create_by_size.png"> <strong>&nbsp;Kreis/Elipse mit definiertem Radius</strong>: 
					 Nach dem Aktivieren der Funktion (Klick auf Button) wird der Mittelpunkt des zu zeichnenden Kreises durch Klicken mit der linken Maustaste in die Karte festgelegt.
					Im sich anschlieﬂend &ouml;ffnenden Dialogfenster, kann der Radius angegeben werden.</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/polygon_create.png"> <strong>&nbsp;Polygon</strong>: 
					Der Akteur bewegt den Mauszeiger zu der Stelle in der Kartenansicht, an welcher er den Zeichenvorgang beginnen will. 
					Der Zeichenvorgang beginnt, sobald das erste Mal in die Karte geklickt (LM-Taste) wurde, nach dem zweiten Klick erscheint das Polygon in der jeweils 
					aktuellen Form und kann durch jeden weiteren Klick sukzessive erweitert werden. Der Zeichenvorgang wird durch einen Doppelklick (LM-Taste) beendet. 
					Sobald die LM-Taste das erste Mal gedr&uuml;ckt wurde, erscheint ein neues Fenster, welches die Eigenschaften des neuen Objektes angezeigt und die 
					M&ouml;glichkeit zur Speicherung bzw. Verwerfung des neuen Objektes bietet.</p>
					</td>
				</tr>
				
				<!--tr>
					<td>
					<p>
					<img src="images/"> <strong>Polygon mit definierten Winkeln und Kantenl&auml;ngen zeichnen</strong>: 
					
					</p>
					</td>
				</tr-->						
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/polygonhole_create.png"> <strong>&nbsp;Loch in Polygon zeichnen</strong>: 
					Zu Beginn muﬂ das entsprechendes Zielpolygon seleketiert werden: 
					Mit der Maus auf den Button 'Objekt selektieren' klicken und dann in der Kartenansicht ein Objekt ausw&auml;hlen. 
					Im Anschluﬂ daran wird der  Button 'Loch in Polygon zeichen' aktiviert und das entsprechende Loch innerhalb des Polygons gezeichnet (siehe Polygon zeichen). 
					Dabei sind folgende Regeln zu beachten:</p>
							  <ul style="font-family:Arial,sans-serif; align:left">
								  <li>das Loch muﬂ vollst&auml;ndig innerhalb des Polygons liegen</li>
								  <li>das Loch darf sich keine St&uuml;tzpunkte mit dem Polygon teilen</li>
								  <li>mehrere L&ouml;cher innerhalb desselben Polygons d&uuml;rfen sich nicht &uuml;berschneiden und d&uuml;rfen sich keine St&uuml;tzpunkte teilen</li>
							  </ul>
				
					</td>
				</tr>
				
				<!--tr>
					<td>
					<p>
					<img src="images/"> <strong>Loch mit Polygon f&uuml;llen</strong>: 
					
					</p>
					</td>
				</tr-->
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
						<h3>Linien neu erstellen</h3>
						<p>Eine Linie beginnt und endet mit einem Knoten und kann zwischen diesen Knoten keinen bis beliebig viele St&uuml;tzpunkte enthalten.
							  Linien k&ouml;nnen nur in einem Layer gezeichnet werden, welcher die entsprechende Geometrie unterst&uuml;tzt bzw. enth&auml;lt.</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/line_create.gif"><strong>&nbsp;Linie Zeichen</strong>: 
					nach der Aktivierung des Buttons beginnt der Zeichenprozess, sobald mit der LM-Taste an der gew&uuml;nschten Stelle in die Karte geklickt wurde. 
					Durch jeden weiteren Klick wird ein neuer St&uuml;tzpunkt gesetzt. Der Zeichenprozess endet mit einem Doppelklick der LM-Taste. 
					Nach dem ersten Klick in die Karte &ouml;ffnet sich ein neues Fenster, in welchem die Eigenschaften des neuen Objektes angezeigt und die M&ouml;glichkeit zur 
					Speicherung bzw. Verwerfung des neuen Objektes geboten werden. Folgende Regeln sind zu beachten:<br></p>
							<ul style="font-family:Arial,sans-serif; align:left">
								<li>die Linien d&uuml;rfen sich beliebig oft &uuml;berschneiden.</li>
								<li>End- und  Angfangsknoten derselben Linie d&uuml;rfen &uuml;bereinander liegen.</li>
								<li>St&uuml;tzpunkte und Knoten bestehender Linien k&ouml;nnen als Anfangs- und/oder Endknoten, sowie als St&uuml;tzpunkte genutzt werden</li>
							</ul>
					
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
					<p><img src="images/parallel.png"> <strong>&nbsp;Paralellen erzeugen</strong>: 
					nach dem Selektieren der entsprechenden Linie/Linien kann die Funktion (klick mit der linken Maustaste auf den Button) Aktiviert werden.
					Im sich neu &ouml;ffnenden Dialogfenster k&ouml;nnen folgende Angaben gemacht werden:</p>
							<ul style="font-family:Arial,sans-serif; align:left">
								<li>linke Parallele erzeugen</li>
								<li>rechte Paralelle erzeugen</li>
								<li>Abstand zur Linie (in Karteneinheiten)</li>
							</ul>
					<p>Jede auf diese Art neu erzeugte Linie wird innerhalb der betreffenden Ebene als neues Objekt gespeichert.</p>
					</td>
				</tr>
				
				<!--tr>
					<td>
					<p>
					<img src="images/"> <strong>Linien verbinden</strong>: 
					</p>
					</td>
				</tr-->
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
						<h3>Punkte neu erstellen</h3>
						<p>Ein Punkt wird durch genau ein x,y-Koordinatenpaar definiert. 
						  Punkte k&ouml;nnen nur in einer Ebene gezeichnet werden, welche die entsprechende Geometrie unterst&uuml;tzt bzw. enth&auml;lt.</p>
					</td>
				</tr>
				
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
				<p><img src="images/point_create.gif"> <strong>&nbsp;Punkt Zeichen</strong>: 
				 durch einmaliges Klicken mit der LM-Taste auf die gew&uuml;nschte Stelle in die Kartenansicht. 
				 Gleichzeitig &ouml;ffnet sich ein neues Fenster, in welchem die Eigenschaften des neuen Objektes angezeigt und die M&ouml;glichkeit zur Speicherung bzw. 
				 Verwerfung des neuen Objektes geboten werden.</p>
					</td>
				</tr>
				<tr>
					<td style="font-family:Arial,sans-serif; align:left">
				<p><img src="images/point_create_by_coords.gif"> <strong>&nbsp;Punkt durch Koordinateneingabe</strong>: 
					  nach dem Aktivieren der Funktion (Klick mit linker Maustaste), &ouml;ffnet sich ein neues Dialogfenster in welchem das 
					  gew&uuml;nschte Koordinatenpaar eingegeben werden kann.</p>
					</td>
				</tr>
				
			</tbody>
		</table>
	</body>
</html>
