<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">
<html>
<head>
  <title></title>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
  <meta content="MSHTML 6.00.2900.3354" name="GENERATOR">
</head>

<body leftmargin="15" style="background-image: url(images/background.jpg);">

<p align="right"><font face="Arial"><img alt="" src="images/deegree_logo.jpg" border="0" height="71" width="300"></font></p>

<p>
<table background="" border="0" cellpadding="4" cellspacing="4" width="100%">

  <tbody align="left"> 
    <tr>
    <td>
      <td>
      <h2><font face="Arial">Objekte bearbeiten</font></h2>
      <p>
      <font face="Arial">
      Mit Hilfe der Funktionen innerhalb dieses Reiters, k&ouml;nnen bestehende Objekte im Vektorformat bearbeitet werden. 
      Basisdatentypen sind Punkt, Linie und Fl&auml;che.<br> 
      Bevor ein Objekt bearbeitet werden kann, muﬂ der entsprechende Ziel-Ebene in der Ebenenansicht selektiert (klick mit der LM-Taste) 
      und editierbar (klick mit der RM-Taste &gt; aus dem Kontextmen&uuml; 'editierbar' ausw&auml;hlen) geschaltet werden. <br><br>
      <img src="images/edit_dialog.png">
      </font>
      </p>
      </td>
    </tr>
    
    <tr>
    <td>
      <td>
      <h3><font face="Arial">St&uuml;tzpunkte bearbeiten</font></h3>
      <p>
      <font face="Arial">
       Bevor ein St&uuml;tzpunkt bearbeitet werden kann, muﬂ die betreffende Geometrie via <img src="images/select.gif"> 
       'Objekt selektieren'-Button ausgew&auml;hlt werden, danach stehen folgende Optionen zur Verf&uuml;gung:<br><br> 
      
      <img src="images/insert_vertex.png"> <strong>&nbsp; St&uuml;tzpunkt hinzuf&uuml;gen: </strong> St&uuml;tzpunkte k&ouml;nnen nur innerhalb von Linien- oder Fl&auml;chen-Geometrien durch einmaliges Klicken mit der LM-Taste auf die gew&uuml;nschte Stelle in die Kartenansicht hinzugef&uuml;gt werden. Gleichzeitig &ouml;ffnet sich ein neues Fenster, in welchem die Eigenschaften des selektierten Objektes angezeigt und die M&ouml;glichkeit zur Speicherung bzw. Verwerfung angeboten werden. Die St&uuml;tzpunkte k&ouml;nnen sowohl auf einer existierenden Linie/Begrenzung, als auch daneben gesetzt werden. Ist letzteres der Fall, wird der Linienverlauf automatisch angepasst. <br><br>
      <img src="images/delete_vertex.png"> <strong>&nbsp; St&uuml;tzpunkt l&ouml;schen: </strong> St&uuml;tzpunkte k&ouml;nnen nur innerhalb von Linien- oder Fl&auml;chen-Geometrien durch einmaliges Klicken mit der LM-Taste auf den gew&uuml;nschten St&uuml;tzpunkt in der Kartenansicht gel&ouml;scht werden. Gleichzeitig &ouml;ffnet sich ein neues Fenster, in welchem die Eigenschaften des selektierten Objektes angezeigt und die M&ouml;glichkeit zur Speicherung bzw. Verwerfung angeboten werden.<br><br> 
      <img src="images/move_vertex.png"> <strong>&nbsp; St&uuml;tzpunkt verschieben: </strong>durch Klicken und Ziehen des gew&uuml;nschten St&uuml;tzpunktes mit gedr&uuml;ckter LM-Taste. Gleichzeitig &ouml;ffnet sich ein neues Fenster, in welchem die Eigenschaften des selektierten Objektes angezeigt und die M&ouml;glichkeit zur Speicherung bzw. Verwerfung angeboten werden. Die St&uuml;tzpunkte k&ouml;nnen sowohl auf einer existierenden Linie/Begrenzung verschoben werden (ver&auml;ndert die Objektform nicht), als auch beliebig innerhalb des Kartenfeldes. Ist letzteres der Fall, wird die Objektform automatisch angepasst.<br><br> 
      <img src="images/merge_vertices.png"> <strong>&nbsp; St&uuml;tzpunkte zusammenfassen: </strong>zuerst werden durch das Aufziehen eines Auswahlrechtecks mit gedr&uuml;ckter LM-Taste die betreffenden St&uuml;tzpunkte ausgew&auml;hlt. Anschlieﬂend kann der neue St&uuml;tzpunkt an einer beliebigen Stelle in der Karte durch einmaliges Klicken mit der LM-Taste gesetzt werden.<br><br>
      </font>
      </p>
      </td>
    </tr>
    
     <tr>
    <td>
      <td>
      <h3><font face="Arial">Punkte bearbeiten</font></h3>
      <p align="left">
      <font face="Arial">
       Bevor ein Punkt/Punktgruppe bearbeitet werden kann, muﬂ die betreffende Geometrie nach dem Aktivieren des <img src="images/select.gif">
        'Objekt selektieren'-Buttons ausgew&auml;hlt werden. Danach stehen folgende Optionen zur Verf&uuml;gung:<br><br> 
      
      <img src="images/shape_square_move.gif"> <strong>&nbsp; Punkte verschieben: </strong>  'Objekt verschieben' aktivieren und dann mit gedr&uuml;ckter LM-Taste das/die gew&uuml;nschte(n) Objekt(e) verschieben. Nach dem Losgelassen der LM-Taste verbleibt das/die Objekt(e) an der letzten Position. <br><br>
      <img src="images/shape_square_delete.gif"> <strong>&nbsp; Punkte l&ouml;schen: </strong> durch das Aktivieren des entsprechenden Buttons werden die gew&uuml;nschten Objekte gel&ouml;scht.<br><br> 
      <img src="images/point_group.gif"> <strong>&nbsp; Punkte gruppieren: </strong> durch das Aktivieren des entsprechenden Buttons werden die gew&uuml;nschten Objekte zu einer MultiPoint-Geometrie zusammengefasst.<br><br> 
      <img src="images/point_ungroup.gif"> <strong>&nbsp; Gruppierung von Punkten aufheben: </strong> durch das Aktivieren des entsprechenden Buttons wird Gruppierung der gew&uuml;nschten MultiPoint-Geometrie aufgehoben.<br><br>
      </font>
      </p>
      </td>
    </tr>
    
    <tr>
    <td>
      <td>
      <h3><font face="Arial">Linien bearbeiten</font></h3>
      <p align="left">
      <font face="Arial">
      Bevor eine Linie/Liniengruppe bearbeitet werden kann, muﬂ die betreffende Geomerie nach dem Aktivieren des <img src="images/select.gif">  
      'Objekt selektieren'-Buttons ausgew&auml;hlt werden. Danach stehen folgende Optionen zur Verf&uuml;gung:<br><br>
      <img src="images/shape_square_move.gif"> <strong>&nbsp; Linie verschieben: </strong> den Button 'Objekt verschieben' aktivieren und dann mit gedr&uuml;ckter LM-Taste das/die gew&uuml;nschte(n) Objekt(e) verschieben. Nach dem Losgelassen der LM-Taste verbleibt das/die Objekt(e) an der letzten Position.<br><br>
      <img src="images/shape_square_delete.gif"> <strong>&nbsp; Linie l&ouml;schen: </strong> durch das Aktivieren des entsprechenden Buttons werden die gew&uuml;nschten Objekte gel&ouml;scht.<br><br>
      <img src="images/split_line.png"> <strong>&nbsp; Linie zerschneiden: </strong>nach dem Aktivieren des entsprechenden Buttons kann eine Linie gezeichnet werde, welche das selektierte Objekt zerschneidet. 
      Durch einen Klick mit der LM-Taste startet den Zeichenprozess, durch einen Doppel-Klick mit der LM-Taste wird der Zeichenprozess beendet und das Objekt wird geteilt.
      </font> 
      </p>
      <p align="left" face="Arial"> Folgende Regeln sind zu beachten:</p> 
       <ul face="Arial" align="left">
        <li>Mit einer Linien k&ouml;nnen eine bis mehrere Objekte zerschnitten werden.</li>
        <li>Ein Objekt kann durch eine Linie mehrmals zerschnitten werden.</li>
        <li>W&auml;hrend des Zeichenprozesses k&ouml;nnen beliebig viele St&uuml;tzpunkte gesetzt werden</li>
        <li>Die St&uuml;tzpunkte benachbarter Objekte k&ouml;nnen als Start- und Endpunkte des Zerschneidungsprozesses genutzt werden, 
            in diesem Fall werden beide Objekte an den jeweiligen St&uuml;tzpunkten zerschnitten.</li>
       </ul>
      <p>
      <font face="Arial">
      <img src="images/union_line.png"> <strong>&nbsp;Linien Verschmelzen: </strong>durch das Aktivieren des Buttons, werden die gew&uuml;nschten Objekte zu einem neuen Objekt verschmolzen.<br><br>
      <img src="images/line_group.gif"> <strong>&nbsp;Linien Gruppieren: </strong> durch das Aktivieren des entsprechenden Buttons werden die gew&uuml;nschten Objekte zu einer MultiLine-Geometrie zusammengefasst.<br><br> 
       <img src="images/line_ungroup.gif"> <strong>&nbsp;Gruppierung von Linien aufheben: </strong> durch das Aktivieren des entsprechenden Buttons wird Gruppierung der gew&uuml;nschten MultiLine-Geometrie aufgehoben.<br><br>
       </font>
      </p>
      </td>
    </tr>
    
    <tr>
    <td>
      <td>
      <h3><font face="Arial">Fl&auml;chen bearbeiten</font></h3>
      <p align="left">
      <font face="Arial">
       Bevor ein Fl&auml;che/Fl&auml;chengruppe bearbeitet werden kann, muﬂ die betreffende Geometrie nach dem Aktivieren des<img src="images/select.gif">  'Objekt selektieren'-Buttons ausgew&auml;hlt werden. Danach stehen folgende Optionen zur Verf&uuml;gung:<br><br> 
      <img src="images/shape_square_move.gif"> <strong>&nbsp;Fl&auml;che verschieben:</strong> Zuerst den Button 'Objekt verschieben' aktivieren und dann mit gedr&uuml;ckter LM-Taste das/die gew&uuml;nschte(n) Objekt(e) verschieben. Nach dem Losgelassen der LM-Taste verbleibt das/die Objekt(e) an der letzten Position innerhalb des Kartenfensters. <br><br>
     <img src="images/shape_square_delete.gif"> <strong>&nbsp;Fl&auml;che l&ouml;schen:</strong> durch das Aktivieren des entsprechenden Buttons werden die gew&uuml;nschten Objekte gel&ouml;scht.<br><br> 
       <img src="images/split_polygon.png"> <strong>&nbsp;Fl&auml;che zerschneiden:</strong> nach dem Aktivieren des entsprechenden Buttons kann eine Linie gezeichnet werde, welche das selektierte Objekt zerschneidet. Durch einen Klick mit der LM-Taste startet den Zeichenprozess, durch einen Doppel-Klick mit der LM-Taste wird der Zeichenprozess beendet und das Objekt wird geteilt. 
      </font></p>
      <p>
      <font face="Arial">
      Folgende Regeln sind zu beachten:</font></p>
       <ul face="Arial" align="left">
      <li>Es kann immer nur ein Objekt auf einmal zerschnitten werden.</li>
      <li>Ein Objekt kann durch eine Linie mehrmals zerschnitten werden.</li>
      <li>W&auml;hrend des Zeichenprozesses k&ouml;nnen beliebig viele St&uuml;tzpunkte gesetzt werden</li>
      <li>Die St&uuml;tzpunkte eines Objektes k&ouml;nnen als Start- und Endpunkte des Zerschneidungsprozesses verwendet werden, solange es sich nicht um benachbarte St&uuml;tzpunkte handelt.</li>
      </ul>
       <p>
      <font face="Arial">
      <img src="images/union_polygon.png"> <strong>&nbsp;Fl&auml;chen verschmelzen:</strong> durch das Aktivieren des Buttons, werden die gew&uuml;nschten Objekte zu einem neuen Objekt verschmolzen.<br><br>
     <img src="images/shape_group.gif">  <strong>&nbsp;Fl&auml;chen gruppieren:</strong> durch das Aktivieren des entsprechenden Buttons werden die gew&uuml;nschten Objekte zu einer MultiOberfl&auml;chen-Geometrie zusammengefasst.<br><br> 
      <img src="images/shape_ungroup.gif"> <strong>&nbsp;Gruppierung von Fl&auml;chen aufheben:</strong> durch das Aktivieren des entsprechenden Buttons wird Gruppierung der gew&uuml;nschten MultiOberfl&auml;chen-Geometrie aufgehoben.<br><br>
      </font>
      </p>
      </td>
    </tr>
    
  </tbody>
</table>

</body>
</html>
